Connect to the Database

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('babe_ruth.db')
cur = conn.cursor()

Return the total number of years that Babe Ruth played professional baseball.

In [4]:
cur.execute("""select count(year) as num_years
                      from babe_ruth_stats;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   num_years
0         22

Return the total number of years Babe Ruth played with the NY Yankees.

In [5]:
cur.execute("""select count(year) as num_years
                      from babe_ruth_stats
                      where team ="NY";""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   num_years
0         15

Select the row with the most HR that Babe Ruth hit in one season.

In [6]:
cur.execute("""select *
                      from babe_ruth_stats
                      where HR = (select max(HR) from babe_ruth_stats);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

,id,year,team,league,doubles,triples,hits,HR,games,runs,RBI,at_bats,BB,SB,SO,AVG
0,14,1927,NY,AL,29,8,192,60,151,158,164,540,137,7,89,0.356

Select the row with the least number of HR hit in one season.

In [7]:
cur.execute("""select *
                      from babe_ruth_stats
                      where HR = (select min(HR) from babe_ruth_stats);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

,id,year,team,league,doubles,triples,hits,HR,games,runs,RBI,at_bats,BB,SB,SO,AVG
0,1,1914,BOS,AL,1,0,2,0,5,1,2,10,0,0,4,0.2

Return the total number of HR hit by Babe Ruth during his career

In [11]:
cur.execute("""select sum(HR)
                      from babe_ruth_stats;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   sum(HR)
0      714

Above you saw that Babe Ruth hit 0 home runs in his first year when he played only five games. To avoid this and other extreme outliers, first filter the data to those years in which Ruth played in at least 100 games. Then, select all of the columns for the 5 worst seasons, in terms of the number of home runs, where he played over 100 games.

In [15]:
cur.execute("""select *
                      from babe_ruth_stats
                      where games > 100
                      group by 1
                      order by hr asc
                      limit 5;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

,id,year,team,league,doubles,triples,hits,HR,games,runs,RBI,at_bats,BB,SB,SO,AVG
0,21,1934,NY,AL,17,4,105,22,125,78,84,365,104,1,63,0.288
1,6,1919,BOS,AL,34,12,139,29,130,103,114,432,101,7,58,0.322
2,20,1933,NY,AL,21,3,138,34,137,97,103,459,114,4,90,0.301
3,9,1922,NY,AL,24,8,128,35,110,94,99,406,84,2,80,0.315
4,10,1923,NY,AL,45,13,205,41,152,151,131,522,170,17,93,0.393

Select the average, AVG, of Ruth's batting averages. The header of the result would be AVG(AVG) which is quite confusing, so provide an alias of career_average.

In [23]:
cur.execute("""select avg(AVG) as average_of_averages
                      from babe_ruth_stats;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   average_of_averages
0             0.322864

Select the total number of years played and hits Babe Ruth had for each team he played for.

In [24]:
cur.execute("""select team,
                      count(year) as num_years,
                      sum(hits) as total_hits
                      from babe_ruth_stats
                      group by 1;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

  team  num_years  total_hits
0  BOS          7         355
1   NY         15        2518

We want to know the years in which Ruth successfully reached base over 300 times. We need to add hits and BB to calculate how many times Ruth reached base. Simply add the two columns together (ie: SELECT hits + BB FROM ...) and give this value an alias of on_base. Select the year and on_base for only those years with an on_base over 300.

In [27]:
cur.execute("""select year,
                      hits + BB as on_base
                      from babe_ruth_stats
                      group by 1
                      having hits + BB > 300
                      order by hits + BB desc;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   year  on_base
0  1923      375
1  1921      349
2  1924      342
3  1927      329
4  1926      328
5  1931      327
6  1920      322
7  1930      322
8  1928      310